Ran Plan for 5 projects:

1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
1. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
1. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
---

### 1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #41. To continue, delete the lock from #41 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 2. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #41. To continue, delete the lock from #41 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 3. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #41. To continue, delete the lock from #41 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 4. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #41. To continue, delete the lock from #41 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 5. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/42/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/42/default/terraform/ecs-web-api": exit status 1
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ecr_repository.web_api: Reading...
aws_cloudwatch_log_group.web_api: Refreshing state... [id=/ecs/crawlinghub-web-api-prod]
data.aws_ssm_parameter.public_subnets: Reading...
aws_iam_role.ecs_task_execution: Refreshing state... [id=crawlinghub-web-api-execution-role-prod]
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
aws_iam_role.ecs_task: Refreshing state... [id=crawlinghub-web-api-task-role-prod]
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
aws_security_group.alb: Refreshing state... [id=sg-0ef60d515aeaa4856]
aws_lb_target_group.web_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/crawlinghub-cluster-prod]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG|AWSCURRENT]
aws_lb.web_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c]
aws_security_group.ecs_web_api: Refreshing state... [id=sg-0fd7d55bae8cd9bf3]
data.aws_ecr_repository.web_api: Read complete after 0s [id=crawlinghub-web-api-prod]
aws_route53_record.web_api: Refreshing state... [id=Z104656329CL6XBYE8OIJ_crawler.set-of.com_A]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/c4bad3409d59ea6c]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/ad6b59d33493d0fa]
aws_iam_role_policy.secrets_access: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-secrets-access-prod]
aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=crawlinghub-web-api-execution-role-prod-20251120143000837000000001]
aws_iam_role_policy.eventbridge_access: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-eventbridge-access-prod]
aws_iam_role_policy.adot_amp_access: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-web-api-adot-amp-prod]
aws_ecs_task_definition.web_api: Refreshing state... [id=crawlinghub-web-api-prod]
aws_ecs_service.web_api: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.web_api will be destroyed
  # (because aws_cloudwatch_log_group.web_api is not in configuration)
  - resource "aws_cloudwatch_log_group" "web_api" {
      - arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/crawlinghub-web-api-prod" -> null
      - id                = "/ecs/crawlinghub-web-api-prod" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/crawlinghub-web-api-prod" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "prod"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
      - tags_all          = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_service.web_api will be updated in-place
  ~ resource "aws_ecs_service" "web_api" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:24" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_api must be replaced
-/+ resource "aws_ecs_task_definition" "web_api" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-web-api-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-web-api-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-web-api"
        }
      + tags_all          = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-web-api-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-web-api"
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
╷
│ Error: reading Route 53 Record (Z104656329CL6XBYE8OIJ_crawler.set-of.com_A): operation error Route 53: GetHostedZone, https response error StatusCode: 403, RequestID: 1b2f5d7b-455a-45d0-ac42-34377a148608, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/e26bf9985bd0415a8a121cca5ddb5738 is not authorized to perform: route53:GetHostedZone on resource: arn:aws:route53:::hostedzone/Z104656329CL6XBYE8OIJ because no identity-based policy allows the route53:GetHostedZone action
│ 
│   with aws_route53_record.web_api,
│   on main.tf line 166, in resource "aws_route53_record" "web_api":
│  166: resource "aws_route53_record" "web_api" {
│ 
╵


```
</details>

---
### Plan Summary

5 projects, 0 with changes, 0 with no changes, 5 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```